Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/mobility-omegat.tmx
Source language: en_us
Languages: pt_br

source: Creates new CDC Class Library project
pt_br: Cria novo projeto de biblioteca de classe CDC

source: Creates new CDC Project with Existing Sources
pt_br: Cria novo projeto CDC com códigos-fonte existentes

source: Select Platform
pt_br: Selecionar plataforma

source: Existing Sources
pt_br: Códigos-fone existentes

source: Main Class name is not valid.
pt_br: Nome da classe principal não é válida.

source: Project Folder is not a valid path.
pt_br: Pasta do projeto não é um caminho válido.

source: Protected - Development
pt_br: Desenvolvimento - protegido

source: Protected - V9 UID
pt_br: UID V9 - protegido - V9 UID

source: Protected - Vendor UID
pt_br: UID fornecedor - protegido

source: Unprotected - V9 UID
pt_br: UID V9 - Desprotegido

source: Unprotected - Development
pt_br: Desenvolvimento - desprotegido

source: UID should have 7 digits in range from 0000000 - FFFFFFF
pt_br: UID deve ter 7 digitos no intervalo de 0000000 - FFFFFFF

source: Result UID:
pt_br: UID do resultado:

source: Project with UID 0x{0} already exists and is deployed!
pt_br: Projeto com UID 0x{0} já existe e já está implantado!

source: &Application Name:
pt_br: Nome da &aplicação:

source: A&pplication Icon:
pt_br: Ícone da a&plicação:

source: Enter Application Name
pt_br: Entre com o nome da aplicação

source: *.mbm Symbian MultiBitMap Files
pt_br: Arquivos *.mbm Symbian MultiBitMap

source: Browse for application icon
pt_br: Procurar por ícone da aplicação

source: Browse Source Packages Folder
pt_br: Procurar pasta de pacotes de código-fonte

source: Browse Test Packages Folder
pt_br: Procurar pasta de pacotes de teste

source: Specify the folders containing the source packages and JUnit test packages.
pt_br: Especificar as pastas contendo pacotes de códigos-fonte e pacotes de teste JUnit.

source: Cannot place the project in a Project Folder that already contains {0}.
pt_br: Não pode colocar o projeto em uma pasta de projeto que já contem {0}.

source: Project Folder was just in use.
pt_br: Pasta de projeto está em uso.

source: Please restart the IDE to reuse folder.
pt_br: Reinicie o IDE para reutilizar a pasta.

source: NetBeans project
pt_br: Projeto NetBeans

source: "build.xml" file
pt_br: arquivo "build.xml"

source: "build" folder
pt_br: pasta "build"

source: "dist" folder
pt_br: pasta "dist"

source: "manifest.mf" file
pt_br: arquivo "manifest.mf"

source: Source Packages Folder {0} does not exist.
pt_br: Pasta de pacotes de códigos-fonte {0} não existe.

source: Test Packages Folder {0} does not exist.
pt_br: Pasta de pacotes de teste {0} não existe.

source: Project Folder has to be located outside of the folder containing packages.
pt_br: Pasta de projeto tem que ser localizado fora da pasta que contem os pacotes.

source: Specify a name and location for the new project.
pt_br: Especificar um nome e a localização de um novo projeto.

source: Source Package Folders:
pt_br: Pastas de pacote de fonte:

source: Test Package Folders:
pt_br: Pastas de pacote de teste:

source: {0} (owned by {1})
pt_br: {0} (pertence à {1})

source: Add CDC Platform
pt_br: Adicionar plataforma CDC

source: This wizard guides you through a CDC project creation.
pt_br: Este assistente o guiará através de um projeto criação CDC.

source: <html>Every CDC project needs to have CDC compatible SDK/platform/emulator assigned to it.
pt_br: <html>Todo projeto CDC necessita ser compatível a emulador/plataforma/SDK assinado por ele.

source: Install SDK/Platform/Emulator...
pt_br: Instalar emulador/plataforma/SDK...

source: <html>No CDC compatible platform is installed in the IDE.<br>You need to have at least one CDC compatible platform installed in the IDE.
pt_br: <html>Nenhuma plataforma CDC compatível está instalada no IDE.<br>Voce precisa ter pelo menos uma plataforma instalada no IDE.

source: Set as Main Project
pt_br: Definir como projeto principal

source: Create Main Class
pt_br: Criar classe principal

source: Select checkbox to create main class in project.
pt_br: Selecionar esta opção para criar classe principal no projeto.

source: &Create Main Class
pt_br: &Criar classe principal

source: Set as &Main Project
pt_br: Definir como projeto &principal

source: Project name
pt_br: Nome do projeto

source: Name of new project
pt_br: Nome do novo projeto

source: Project Location:
pt_br: Localização do projeto:

source: Location of the project's root folder
pt_br: Localização da pasta raiz do projeto

source: Click the Browse button to open the project location chooser.
pt_br: Clique o botão Procurar para abrir a escolha da lozalização do projeto.

source: Select the folders that contain existing Java packages.
pt_br: Selecionar as pastas que contem pacotes Java existentes.

source: Specify the name of project's Main Class.
pt_br: Especificar o nome da classe principal do projeto.

source: Test Packages Folder
pt_br: Pasta de pacotes de teste

source: Specify the folder that contains the test package root.
pt_br: Especificar a pasta que contem a raiz do pacote de teste.

source: Source Packages Folder
pt_br: Pasta de pacotes de código-fonte

source: Specify the folder that contains the source package root.
pt_br: Especificar a pasta que contem a raiz do pacote de código-fonte.

source: The specified package folder contains compiled class files (*.class).
pt_br: A pasta de pacote especificado contem arquivos de classe compilados (*.class).

source: Because the IDE generates compiled class files in the "build" folder, it is recommended that you delete the existing compiled class files.
pt_br: Já que o IDE gera classes compiladas na pasta "build", é recomendado voce excluir os arquivos de classe compilados existentes.

source: Do you want do delete the class files now?
pt_br: Deseja excluir os arquivos de classe agora?

source: New CDC Project with Existing Sources
pt_br: Novo projeto CDC com códigos-fonte existentes

source: Delete
pt_br: Excluir

source: Ignore
pt_br: Ignorar

source: Add Folder...
pt_br: Adicionar pasta...

source: &Application name
pt_br: Nome da &aplicação

source: Specify application name
pt_br: Especificar nome da aplicação

source: &Java Platform:
pt_br: Plataforma &Java:

source: <html>Specify location of {0} project.</html>
pt_br: <html>Especificar localização do projeto {0}.</html>

source: Specify location of {0} project
pt_br: Especificar localização do projeto {0}

source: &Project Location:
pt_br: Localização do &project:

source: Import existing {0} project
pt_br: Importar projeto {0} existente

source: Specify {0} Project
pt_br: Especificar projeto {0}

source: Location of your {0} Project
pt_br: Localização de seu projeto {0}

source: Opens File Chooser for Project Location.
pt_br: Abrir um seletor de arquivos para localização de projetos.

source: Invalid project location.
pt_br: Localização de projeto inválido.

source: Please select an existing directory with a project.
pt_br: Selecione um diretório existente com um projeto.

source: Support for Connected Device Configuration development (JSR 36 and JSR 218)
pt_br: Suporte para desenvolvimento de configuração de dispositivo conectado (JSR 36 e JSR 218)

source: Java ME CDC Nokia S80 Plugin Implementation
pt_br: Implementação de plugin CDC Nokia S80 Java ME

source: Image files of type *gif, *png.
pt_br: Arquivos de imagem do tipo *gif, *png.

source: Br&owse
pt_br: Navegad&or

source: Application icon
pt_br: Ícone da aplicação

source: Nokia Series 80 Build System Ant Utilities
pt_br: Construir utilitários do sistema Ant Nokia Series 80

source: Java ME CDC NSIcom Plugin Implementation
pt_br: Implementação de plugin CDC NSIcom Java ME

source: ActiveSync Java Wrapper Library
pt_br: Biblioteca Wrapper Java ActiveSync

source: Monitoring host &IP address:
pt_br: Endereço &IP de monitoração host:

source: Run VM in &verbose mode
pt_br: Executar VM em modo &verbose

source: &Run in remote VM
pt_br: &Executar no VM remoto

source: Remote VM &Location:
pt_br: &Localização VM remoto:

source: &Application Location:
pt_br: Localização da &aplicação:

source: ActiveSync library can not be loaded
pt_br: Biblioteca ActiveSync não pode ser carregada

source: Device is not connected
pt_br: Dispositivo não está conectado

source: Browse remote VM location
pt_br: Procurar localização VM remoto

source: Java ME CDC SavaJe Plugin Implementation
pt_br: Implementação do plugin Java ME CDC SavaJe

source: Browse for policy file
pt_br: Procurar por arquivo policy

source: Policy files *.policy
pt_br: Arquivo policy *.policy

source: Policy File:
pt_br: Arquivo policy:

source: Phone &Mount Point:
pt_br: Ponto para &montar telefone:

source: Mount point in format C:,D:
pt_br: Ponto para montar no formato C:,D:

source: &Debug Port:
pt_br: Porta de &depurador:

source: &Add debug information to jnlp file.
pt_br: &Adicionar informação de depuração para arquivo jnlp.

source: Application Icon &Small:
pt_br: Ícone &pequeno ícone de aplicação:

source: Application Icon &Focused:
pt_br: Ícone &centrado da aplicação:

source: Br&owse..
pt_br: Navegad&or..

source: Application icon small
pt_br: Ícone pequeno da aplicação

source: Application icon focused
pt_br: Ícone centrado da aplicação

source: SavaJe Deployment
pt_br: Deployment SavaJe

source: Phone mount point
pt_br: Ponto para montar telefone

source: Debug port
pt_br: Porta do depurador

source: Add debug information to jnlp file
pt_br: Adicionar informação de depurador para arquivo jnlp

source: SavaJe Build System Ant Utilities
pt_br: Contruir utilitários do sistema Ant SavaJe

source: Java ME CDC Sony Ericsson Plugin Implementation
pt_br: Implementação de plugin CDC Sony Ericsson Java ME

source: Cha&nge...
pt_br: Alter&ar...

source: Application &Logo Icon:
pt_br: Ícone &logo da aplicação:

source: Show logo &during installation time only.
pt_br: Exibir logo &durante apenas o tempo de instalaçao.

source: Image files of type *gif, *png, *bmp or *mbm.
pt_br: Arquivos de imagens do tipo *gif, *png, *bmp ou *mbm.

source: Browse for logo image
pt_br: Procurar por imagem de logo

source: Certi&ficate Location:
pt_br: Localização de certi&ficado:

source: &Private Key Location:
pt_br: Localização cd chave &privada:

source: Pa&ssword:
pt_br: Se&nha:

source: Note: Pasword is stored in unsecure form.
pt_br: Nota: Senha esta armazenada em formulário não seguro.

source: Browse for private key file
pt_br: Procurar por arquivo de chave privada

source: Browse for certificate file
pt_br: Procurar por arquivo de ceertificado

source: &Application UID:
pt_br: UID da &aplicação

source: Application Capabili&ties:
pt_br: Capaci&dades de aplicação:

source: Application Capabilities separated by +.
pt_br: Capacidades de aplicação separadas por +.

source: File contains {0} icons, first 6 scaled (if bigger than 64 px):
pt_br: Arquivo contem ícones {0}, primeiros 6 escalados (se maior que 64 px):

source: bmconv.exe is not available or not included on PATH!
pt_br: bmconv.exe não está disponível ou não foi incluído no PATH!

source: Image preview is not available for JDK1.4.
pt_br: Imagem anterior não está disponível para JDK1.4.

source: MBM &details:
pt_br: &Detalhes MBM:

source: Application UID
pt_br: UID da aplicação

source: Application logo icon
pt_br: Ícone logo da aplicação

source: Application capabilities
pt_br: Capacidades da aplicação

source: Certificate location
pt_br: Localização do certificado

source: Private key Location
pt_br: Localização da chave privada

source: Change
pt_br: Alterar

source: Show logo during installation time only.
pt_br: Exibir logo durante apenas o tempo de instalação.

source: Sony Ericsson Build System Ant Utilities
pt_br: Construir utilitários de sistema Ant Sony Ericsson

source: Java ME CDC Ricoh Plugin Implementation
pt_br: Implementação do plugin Java ME CDC Ricoh

source: Ricoh deployment properties
pt_br: Propriedades deployment ricoh

source: Server &Host:
pt_br: &Máquina do servidor:

source: Server &Port:
pt_br: &Porta do servidor:

source: HTTP &Xlet Path:
pt_br: Caminho &Xlet HTTP:

source: HTTP &Port:
pt_br: &Porta HTTP:

source: SSH &Upload Path:
pt_br: Caminho para &carregar SSH:

source: Remot&e Port:
pt_br: Porta remo&ta:

source: SSH Key &File:
pt_br: &Arquivo chave SSH:

source: &Connect and Obtain/Verify Host Key
pt_br: &Conectar e obter/verificar chave da máquina

source: Target Server
pt_br: Servidor destino

source: HTTP Xlet Path
pt_br: Caminho Xlet HTTP

source: HTTP Port
pt_br: Porta HTTP

source: SSH Upload Path
pt_br: Caominho para carregar SSH

source: Remote Port
pt_br: Porta remota

source: SSH Key File
pt_br: Arquivo chave

source: Connect and Obtain/Verify Host Key
pt_br: Conectar e obter/verificar chave da máquina

source: Browse Key File
pt_br: Procurar arquivo chave

source: S&hare Name and Path:
pt_br: Caminho e par&te do nome:

source: Share Name and Path
pt_br: Caminho e parte do nome

source: Secure Copy (SCP)
pt_br: Cópia segura (SCP)

source: Turn o&ff IDE managed DALP support (for directly edited the DALP file)
pt_br: Desli&gue IDE gerado pelo DALP (para diretamente editado no arquivo DALP)

source: Ricoh Build System Ant Utilities
pt_br: Construir utilitários do sistema Ant Ricoh

source: Ricoh Xlet
pt_br: Xlet ricoh

source: Creates a new Ricoh xlet.
pt_br: Cria uma nova xlet ricoh.

source: An electronic version of a fun slide puzzle
pt_br: Uma versão eletrônica de um divertido slide de quebra-cabeça

source: This xlet configures SNTP on its own MFP via telnet connection
pt_br: A xlet configura SNTP no próprio MFP via conexão telnet

source: Displays all the button shapes available
pt_br: Mostra todos os botões que moldam disponíveis

source: Demonstrates how to safely lock and unlock the system
pt_br: Demonstra como bloquear e desbloquear o sistema com segurança

source: A sample that catches hard key events
pt_br: Um exemplo que captura eventos chave hard

source: uiwidgets Example Xlet
pt_br: Xlet de exemplo uiwidgets

source: Control xlet functions via XHTML web pages
pt_br: Controle de funções xlet via páginas web XHTML

source: Generating client
pt_br: Gerando cliente

source: Generating beans
pt_br: Gerando beans

source: Generating servlet class
pt_br: Gerando classe servlet

source: Generating invocation class
pt_br: Gerando classe de invocação

source: Generating gateway class
pt_br: Gerando classe gateway

source: Generating utility classes
pt_br: Gerando classe utilitária

source: Configuration file corrupted
pt_br: Arquivo de configuração corrompida

source: Server project {0} is not opened.
pt_br: Projeto servidor {0} não está aberto

source: Generating Stub classes...
pt_br: Gerando classes Stub...

source: Opening configuration file...
pt_br: Abrindo arquivo de configuração...

source: Sample MIDlet was not generated.
pt_br: Amostra MIDlet não foi gerado.

source: End To End Client configuration file
pt_br: Arquivo de configuração de cliente end to end

source: Generator module for creating Java ME clients bridging to Java EE backends.
pt_br: Módulo gerador para criação de de clientes Java ME apontando para retornos de finalização Java EE.

source: Mobile Client to Web Application Generator
pt_br: Cliente móvel para gerador de aplicação web

source: Creates a mobile client for connecting to a server.
pt_br: Cria um cliente móvel de conexão para um servidor.

source: Generates a Java ME class that connects to an existing Java EE application or web service provider through automatically generated servlet middleware.
pt_br: Gerador de uma classe Java ME que conecta para uma aplicação Java EE existente ou provedor de serviço web através de middleware servlet gerado automaticamente.

source: Web project must be built before using Mobile Client to Web Application Generator!
pt_br: Projeto web deve ser construído antes de usar cliente móvel para gerador de aplicação web!

source: Generating Mobile Client to Web Application
pt_br: Geração cliente móvel para aplicação web

source: Generating proxy stubs
pt_br: Geração proxy stubs

source: Scanning data structures
pt_br: Analisando estrutura de dados

source: Creating java files
pt_br: Criando arquivos java

source: Successfuly generated Mobile Client to Web Application.
pt_br: Cliente móvel gerado com sucesso para aplicação web.

source: Generation of Mobile Client to Web Application failed.
pt_br: Falha na geração de cliente móvel para aplicação web.

source: See Output tab for details!
pt_br: Veja guia de saída para detalhes!

source: Mobile Client to Web Application
pt_br: Cliente móvel para aplicação web

source: Generate ...
pt_br: Gerar ...

source: Servlet and Client Type
pt_br: Tipo de servlet em cliente

source: Methods In Web Project
pt_br: Métodos no projeto web

source: Client Options
pt_br: Opção cliente

source: The Class Name is not valid
pt_br: O nome da classe não é válida

source: The Package Name is not valid
pt_br: O nome do pacote não é válildo

source: No Web Service Reference is available
pt_br: Nenhuma referência de serivço web está disponível

source: This project does not contain any Web Service Reference
pt_br: Este projeto não contem nenhuma referência de serviço web

source: Mobile client to Web Application
pt_br: Cliente móvel para aplicação web

source: Methods in Web &Application
pt_br: Métodos em &aplicação web

source: &Client name:
pt_br: Nome do &cliente:

source: Pro&ject:
pt_br: Pro&jeto:

source: &Package:
pt_br: &Pacote:

source: C&reated File:
pt_br: Arquivo c&riado:

source: &Generate stubs
pt_br: &Gerar stubs

source: Generate grouped calls
pt_br: Gerar chamadas agrupadas

source: A&llow floating point
pt_br: Permi&tir ponto flutuante

source: Generate tracing code
pt_br: Gerar código traçado

source: Create &DataBinding structures
pt_br: Criar estruturas &DataBinding

source: The file {0} already exists.
pt_br: O arquivo {0} já existe.

source: Methods for grouped calls will not be generated in Sample MIDlet.
pt_br: Métodos para chamadas agrupadas não serão geradas em Amostra MIDlet.

source: Sample MIDlet will not be generated for grouped calls.
pt_br: Amostra MIDlet não será gerado por chamadas agrupadas.

source: Cannot instantiate gui
pt_br: Não é possível instanciar gui

source: Choose File Type
pt_br: Escolher tipo de arquivo

source: Web Service Operations
pt_br: Operações de serviço web

source: At least one service must be selected
pt_br: Pelo menos um serviço deve ser selecionado

source: Specify name of new servlet that will perform communication between mobile client and web application.
pt_br: Especificar nome do novo servlet que fará comunicação entre cliente móvel e aplicação web.

source: Web Application Panel
pt_br: Painel de aplicação web

source: Open Web Project...
pt_br: Abrir projeto web...

source: <No Web Project>
pt_br: <Nenhum projeto web>

source: newpackage
pt_br: Novopacote

source: &Web Application:
pt_br: Aplicação &web:

source: &Servlet Name:
pt_br: Nome do &servlet:

source: &Location:
pt_br: &Localização:

source: Created &File:
pt_br: &Arquivo criado:

source: Web Project must be specified.
pt_br: Projeto web deve ser especificado.

source: Servlet Class Name should be specified
pt_br: Nome da classe servlet deve ser especificado

source: Folder does not exist
pt_br: Pasta não existe

source: Folder is read only
pt_br: Pasta está somente para leitura

source: Computing Web Service Clients...
pt_br: Computando clientes de Serviço web...

source: No Web Service Client Available in Project
pt_br: Nenhum cliente de serviço web disponível no projeto

source: Warning: As of JDK 1.4, it is highly recommended that you do NOT place Java classes in the default package.
pt_br: Aviso: Como do JDK 1.4, é altamente recomendado que você NÃO coloque classes Java no pacote padrão.

source: Please select client type option
pt_br: Selecione uma opção do tipo cliente

source: Web project must be built before using Mobile Client to Web Application for Web Services
pt_br: Projeto web deve ser construído antes de usra cliente móvel para aplicação web para serviços web

source: Mobile Client Uses:
pt_br: Utiliza cliente móvel:

source: Web Service Clie&nt in Web Application:
pt_br: Clie&nte de serviço web em aplicação web:

source: Web Service Reference:
pt_br: Referência de serviço web:

source: The chosen project is not a valid web project.
pt_br: O projeto escolhido não é um projeto web válido.

source: Not a project directory
pt_br: Sem diretóriode projeto

source: Generated servlet for Mobile Client to Web Application
pt_br: Gerarado servlet de cliente móvel para aplicação web

source: &Generate Stubs
pt_br: &Gerar stubs

source: Please wait, preparing Web Services...
pt_br: Aguarde, preparando serviços web...

source: Services specified in config file are not present in J2EE project
pt_br: Serviços especificados no arquivo config não estão presentes no projeto J2EE

source: Exported Services
pt_br: Serviços exportados

source: Client Information
pt_br: Informação do cliente

source: Pac&kage:
pt_br: Pac&ote:

source: &Servlet name:
pt_br: Nome do &servlet:

source: &Generate tracing code
pt_br: &Gerar código traçado

source: Server Information
pt_br: Informação do server

source: Ge&nerate stubs
pt_br: Ge&rar stubs

source: Allow &floating point
pt_br: Permitir ponto &flutuante

source: Method&s:
pt_br: Método&s:

source: Operation&s:
pt_br: Operaçõe&s:

source: Please wait, computing available methods...
pt_br: Aguarde, computando métodos disponíveis...

source: At least one service operation must be selected
pt_br: Pelo menos uma operação de serviço deve ser selecionada

source: No valid method is available in this project
pt_br: Nenhum método válido está disponível neste projeto

source: Web project must be built before generating Web Service Client!
pt_br: Projeto web deve ser construído antes de gerar cliente de serviço web!

source: Client
pt_br: Cliente

source: Server
pt_br: Servidor

source: Services
pt_br: Serviços

source: File already exists in selected directory
pt_br: Arquivo já existe no diretório selecionado

source: Genera&te DataBinding Structures
pt_br: Gera&r estruturas dataBinding

source: Mobility End to End
pt_br: Mobilidade end to end

source: Support for mobility end-to-end such as mobile web services or mobile to web
pt_br: Suporte para mobilidade end-to-end tais como serviços web móvel ou móvel para web

source: Stub generator for Java ME Web Services Clients (JSR 172)
pt_br: Gerador Stub para clientes de serviços web Java ME (JSR 172)

source: Java ME Web Services Clients (JSR 172)
pt_br: Clientes de serviço Java ME (JSR 172)

source: Creates new Java ME Web Services (JSR 172) Client.
pt_br: Cria novo serviço web Java ME (JSR 172) Client.

source: Generating Java ME Web Services client...
pt_br: Gerando cliente de serviços web Java ME...

source: Generating settings file...
pt_br: Gerando arquivo de configuração...

source: Generating Java ME Web Services stubs...
pt_br: Gerando stubs de serviços web Java ME Web...

source: The {0} file disappeared!
pt_br: O arquivo {0} desapareceu!

source: Java ME Web Services client was successfuly generated
pt_br: Cliente de serviços web Java ME foi gerado com sucesso

source: Java ME Web Services client stubs generation failed!
pt_br: Geração stubs de cliente de serviços web Java ME falhou!

source: Select the source of the WSDL description for the web service to be added to this project.
pt_br: Selecionar o código-fonte da descrição WSDL para o serviço web para ser adicionado neste projeto.

source: Java ME Web Service Client
pt_br: Cliente de serviço web Java ME

source: unknown
pt_br: desconhecido

source: Download failed.
pt_br: Baixa falhou.

source: {0} (Check the proxy settings.)
pt_br: {0} (Verificar as configurações do proxy.)

source: WSDL file is does not exist.
pt_br: Arquivo WSDL não existe.

source: Validating...
pt_br: alidando...
